Revit 2027 API
TableSectionData.IsValidColumnNumber Method
 Verifies if the column number is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidColumnNumber(
	int nCol
)
Public Function IsValidColumnNumber (
	nCol As Integer
) As Boolean
public:
bool IsValidColumnNumber(
	int nCol
)
member IsValidColumnNumber :
        nCol : int -> bool
Parameters
nCol Int32
 The column number.
Return Value
Boolean
 True if the column number is between FirstColumnNumber and LastColumnNumber, false otherwise.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace